gcc
make
git
ripgrep
fd-find
unzip
jq
wget
ffmpeg
rust
cargo
dotnet-sdk-8.0
golang
nodejs-npm
luarocks
java-latest-openjdk-devel
composer
alacritty
neovim
neovide
git-credential-oauth
cascadia-code-nf-fonts
cascadia-mono-nf-fonts
fontconfig
libxkbcommon
libxkbcommon-x11
libwayland-egl
libglvnd-egl
